#pragma once
#include <iostream>
#include "Main.h"

using namespace std;

#define random(x) (rand()%x)
#define PI 3.141593
#define DEADLINE 12000 // 比赛时长（帧数）
#define FILE0 "debug_blue.txt"
#define FILE1 "debug_red.txt"

/*全局调参常量*/
//设置四张图的专用参数组 其中[0]为默认参数组
static MapParams mapparams[5] = {
    //   L2         L3          SPEED       BETA        OMEGA       ETA         ALPHA       MIU
        {1.00,      1.00,       0.8,       1.00,       0.60,        1.00,       2.00,       1.00}, //defeat

        {1.00,      1.00,       0.8,       1.00,       0.40,        1.00,       2.00,       1.00}, //1类图

        {1.00,      1.00,       0.8,       1.00,       0.20,        1.00,       2.00,       1.00}, //2类图

        {1.00,      1.00,       0.8,       1.00,       0.20,        1.00,       2.00,       1.00}, //3类图

        {1.00,      1.00,       0.8,       1.00,       0.10,        1.00,       3.00,       1.00}, //4类图
};

//设置站类型信息
static StationType stationType[10] = {
    {0,0,0,0,0,0,0,0,0.0},
    {1,0b00000000,0b00000000,50,3000,6000,(6000 - 3000),0,0.0},
    {2,0b00000000,0b00000000,50,4400,7600,(7600 - 4400),0,0.0},
    {3,0b00000000,0b00000000,50,5800,9200,(9200 - 5800),0,0.0},
    {4,0b00000110,0b00000110,500,15400,22500,(22500 - 15400),0,0.0},
    {5,0b00001010,0b00001010,500,17200,25000,(25000 - 17200),0,0.0},
    {6,0b00001100,0b00001100,500,19200,27500,(27500 - 19200),0,0.0},
    {7,0b01110000,0b01110000,1000,76000,105000,(105000 - 76000),0,0.0},
    {8,0b00000000,0b10000000,1,0,0,0,0,0.0},
    {9,0b00000000,0b11111110,1,0,0,0,0,0.0}
};

/*全局常量*/
static float MAXV = 6; // 最大估计速度（用于调度预测）
extern int TEAM; //队伍标识 蓝队：0，红队：1

/*全局变量声明*/
extern State state; //帧状态


